{
  "[PAD]": 0,
  "[CLS]": 1,
  "[SEP]": 2,
  "[MASK]": 3,
  "[UNK]": 4,
  "type#function_definition": 5,
  "function_ID#function_declarator": 6,
  "punctuation#parameter_list": 7,
  "type#parameter_declaration": 8,
  "punctuation#compound_statement": 9,
  "op#pointer_expression": 10,
  "punctuation#cast_expression": 11,
  "keyword#type_qualifier": 12,
  "type_identifier#type_descriptor": 13,
  "op#abstract_pointer_declarator": 14,
  "number_literal#cast_expression": 15,
  "op#assignment_expression": 16,
  "punctuation#parenthesized_expression": 17,
  "number_literal#binary_expression": 18,
  "op#binary_expression": 19,
  "punctuation#expression_statement": 20,
  "type_identifier#function_definition": 21,
  "identifier#ERROR": 22,
  "type_identifier#parameter_declaration": 23,
  "identifier#assignment_expression": 24,
  "identifier#binary_expression": 25,
  "identifier#cast_expression": 26,
  "keyword#return_statement": 27,
  "punctuation#return_statement": 28,
  "type_identifier#declaration": 29,
  "identifier#declaration": 30,
  "punctuation#declaration": 31,
  "function_ID#call_expression": 32,
  "punctuation#argument_list": 33,
  "identifier#return_statement": 34,
  "type#ERROR": 35,
  "keyword#if_statement": 36,
  "string_literal#argument_list": 37,
  "identifier#argument_list": 38,
  "call#function_declarator": 39,
  "keyword#for_statement": 40,
  "punctuation#for_statement": 41,
  "identifier#field_expression": 42,
  "punctuation#field_expression": 43,
  "field_identifier#field_expression": 44,
  "op#unary_expression": 45,
  "identifier#unary_expression": 46,
  "string_literal#ERROR": 47,
  "punctuation#ERROR": 48,
  "keyword#while_statement": 49,
  "number_literal#parenthesized_expression": 50,
  "op#pointer_declarator": 51,
  "identifier#parameter_declaration": 52,
  "identifier#pointer_declarator": 53,
  "number_literal#assignment_expression": 54,
  "keyword#sizeof_expression": 55,
  "identifier#parenthesized_expression": 56,
  "identifier#update_expression": 57,
  "op#update_expression": 58,
  "identifier#subscript_expression": 59,
  "punctuation#subscript_expression": 60,
  "number_literal#argument_list": 61,
  "identifier#pointer_expression": 62,
  "op#conditional_expression": 63,
  "number_literal#conditional_expression": 64,
  "punctuation#conditional_expression": 65,
  "keyword#do_statement": 66,
  "keyword#break_statement": 67,
  "punctuation#break_statement": 68,
  "punctuation#do_statement": 69,
  "identifier#init_declarator": 70,
  "op#init_declarator": 71,
  "boolean#init_declarator": 72,
  "keyword#assignment_expression": 73,
  "boolean#assignment_expression": 74,
  "keyword#binary_expression": 75,
  "call#call_expression": 76,
  "type#type_descriptor": 77,
  "punctuation#comma_expression": 78,
  "string_literal#assignment_expression": 79,
  "number_literal#subscript_expression": 80,
  "number_literal#init_declarator": 81,
  "identifier#conditional_expression": 82,
  "statement_identifier#labeled_statement": 83,
  "punctuation#labeled_statement": 84,
  "keyword#cast_expression": 85,
  "keyword#storage_class_specifier": 86,
  "number_literal#return_statement": 87,
  "keyword#switch_statement": 88,
  "keyword#case_statement": 89,
  "identifier#case_statement": 90,
  "punctuation#case_statement": 91,
  "type#declaration": 92,
  "type#sized_type_specifier": 93,
  "keyword#conditional_expression": 94,
  "keyword#init_declarator": 95,
  "boolean#return_statement": 96,
  "keyword#goto_statement": 97,
  "statement_identifier#goto_statement": 98,
  "punctuation#goto_statement": 99,
  "identifier#array_declarator": 100,
  "punctuation#array_declarator": 101,
  "keyword#argument_list": 102,
  "string_literal#concatenated_string": 103,
  "punctuation#initializer_list": 104,
  "identifier#initializer_list": 105,
  "string_literal#conditional_expression": 106,
  "type#binary_expression": 107,
  "type#pointer_declarator": 108,
  "type#cast_expression": 109,
  "number_literal#array_declarator": 110,
  "...#variadic_parameter": 111,
  "punctuation#sizeof_expression": 112,
  "keyword#continue_statement": 113,
  "punctuation#continue_statement": 114,
  "quote#char_literal": 115,
  "string_literal#initializer_list": 116,
  "number_literal#initializer_list": 117,
  "number_literal#unary_expression": 118,
  "keyword#field_expression": 119,
  "string_literal#cast_expression": 120,
  "punctuation#field_designator": 121,
  "field_identifier#field_designator": 122,
  "op#initializer_pair": 123,
  "identifier#initializer_pair": 124,
  "string_literal#init_declarator": 125,
  "keyword#struct_specifier": 126,
  "type_identifier#struct_specifier": 127,
  "escape_sequence#char_literal": 128,
  "keyword#attribute_specifier": 129,
  "punctuation#attribute_specifier": 130,
  "call#pointer_declarator": 131,
  "call#binary_expression": 132,
  "call#argument_list": 133,
  "type#field_expression": 134,
  "keyword#parenthesized_expression": 135,
  "punctuation#parenthesized_declarator": 136,
  "identifier#macro_type_specifier": 137,
  "punctuation#macro_type_specifier": 138,
  "keyword#type_descriptor": 139,
  "keyword#ERROR": 140,
  "call#field_expression": 141,
  "keyword#pointer_declarator": 142,
  "number_literal#case_statement": 143,
  "punctuation#abstract_parenthesized_declarator": 144,
  "call#goto_statement": 145,
  "call#labeled_statement": 146,
  "call#cast_expression": 147,
  "call#array_declarator": 148,
  "call#parenthesized_expression": 149,
  "call#subscript_expression": 150,
  "call#assignment_expression": 151,
  "keyword#enum_specifier": 152,
  "type_identifier#enum_specifier": 153,
  "string_literal#return_statement": 154,
  "type#subscript_expression": 155,
  "type#argument_list": 156,
  "number_literal#ERROR": 157,
  "number_literal#initializer_pair": 158,
  "punctuation#compound_literal_expression": 159,
  "keyword#initializer_list": 160,
  "identifier#expression_statement": 161,
  "number_literal#pointer_expression": 162,
  "call#pointer_expression": 163,
  "string_literal#parenthesized_expression": 164,
  "string_literal#comma_expression": 165,
  "identifier#comma_expression": 166,
  "directive#ERROR": 167,
  "string_literal#subscript_expression": 168,
  "function_ID#function_definition": 169,
  "type_identifier#ERROR": 170,
  "keyword#function_definition": 171,
  "keyword#function_declarator": 172,
  "call#declaration": 173,
  "keyword#union_specifier": 174,
  "type_identifier#union_specifier": 175,
  "keyword#declaration": 176,
  "punctuation#abstract_array_declarator": 177,
  "number_literal#abstract_array_declarator": 178,
  "call#init_declarator": 179,
  "call#ERROR": 180,
  "string_literal#expression_statement": 181,
  "type_identifier#compound_statement": 182,
  "quote#ERROR": 183,
  "op#ERROR": 184,
  "...#ERROR": 185,
  "keyword#call_expression": 186,
  "punctuation#field_declaration_list": 187,
  "type_identifier#field_declaration": 188,
  "field_identifier#field_declaration": 189,
  "punctuation#field_declaration": 190,
  "call#parameter_declaration": 191,
  "identifier#for_statement": 192,
  "identifier#sizeof_expression": 193,
  "identifier#parenthesized_declarator": 194,
  "boolean#argument_list": 195,
  "ERROR#ERROR": 196,
  "string_literal#call_expression": 197,
  "boolean#binary_expression": 198,
  "boolean#parenthesized_expression": 199,
  "boolean#conditional_expression": 200,
  "string_literal#binary_expression": 201,
  "type#init_declarator": 202,
  "type#parenthesized_declarator": 203,
  "op#call_expression": 204,
  "keyword#compound_statement": 205,
  "keyword#parameter_declaration": 206,
  "number_literal#comma_expression": 207,
  "type#assignment_expression": 208,
  "type#call_expression": 209,
  "type#field_declaration": 210,
  "field_identifier#pointer_declarator": 211,
  "type#parenthesized_expression": 212,
  "type_identifier#sized_type_specifier": 213,
  "type#update_expression": 214,
  "type#pointer_expression": 215,
  "call#function_definition": 216,
  "keyword#subscript_expression": 217,
  "call#return_statement": 218,
  "string_literal#sizeof_expression": 219,
  "keyword#pointer_expression": 220,
  "keyword#update_expression": 221,
  "punctuation#enumerator_list": 222,
  "identifier#enumerator": 223,
  "field_identifier#array_declarator": 224,
  "op#enumerator": 225,
  "number_literal#enumerator": 226,
  "type_identifier#translation_unit": 227,
  "directive#preproc_call": 228,
  "preproc_arg#preproc_call": 229,
  "type#unary_expression": 230,
  "field_identifier#ERROR": 231,
  "boolean#initializer_list": 232,
  "keyword#array_declarator": 233,
  "keyword#unary_expression": 234,
  "directive#preproc_ifdef": 235,
  "identifier#preproc_ifdef": 236,
  "L'#char_literal": 237,
  "call#struct_specifier": 238,
  "type#function_declarator": 239,
  "keyword#initializer_pair": 240,
  "call#unary_expression": 241,
  "type#expression_statement": 242,
  "string_literal#initializer_pair": 243,
  "keyword#ms_declspec_modifier": 244,
  "punctuation#ms_declspec_modifier": 245,
  "identifier#ms_declspec_modifier": 246,
  "punctuation#subscript_designator": 247,
  "number_literal#subscript_designator": 248,
  "identifier#abstract_array_declarator": 249,
  "type#array_declarator": 250,
  "call#field_designator": 251,
  "punctuation#bitfield_clause": 252,
  "number_literal#bitfield_clause": 253,
  "keyword#type_definition": 254,
  "type#type_definition": 255,
  "type_identifier#pointer_declarator": 256,
  "punctuation#type_definition": 257,
  "type_identifier#type_definition": 258,
  "number_literal#field_expression": 259,
  "identifier#subscript_designator": 260,
  "call#case_statement": 261,
  "keyword#expression_statement": 262,
  "::#ERROR": 263,
  "call#update_expression": 264,
  "ms_restrict_modifier#ms_pointer_modifier": 265,
  "call#type_descriptor": 266,
  "escape_sequence#ERROR": 267,
  "call#for_statement": 268,
  "number_literal#call_expression": 269,
  "string_literal#unary_expression": 270,
  "boolean#initializer_pair": 271,
  "type#return_statement": 272,
  "boolean#ERROR": 273,
  "call#conditional_expression": 274,
  "call#parenthesized_declarator": 275,
  "keyword#parenthesized_declarator": 276,
  "boolean#parameter_declaration": 277,
  "keyword#comma_expression": 278,
  "boolean#comma_expression": 279,
  "type#initializer_list": 280,
  "op#parenthesized_declarator": 281,
  "type_identifier#function_declarator": 282,
  "call#macro_type_specifier": 283,
  "boolean#cast_expression": 284,
  "type#comma_expression": 285,
  "keyword#ms_call_modifier": 286,
  "number_literal#for_statement": 287,
  "keyword#field_designator": 288,
  "type_identifier#array_declarator": 289,
  "op#field_expression": 290,
  "type#struct_specifier": 291,
  "op#parenthesized_expression": 292,
  "keyword#sized_type_specifier": 293,
  "call#field_declaration": 294,
  "call#initializer_pair": 295,
  "string_literal#field_expression": 296,
  "type_identifier#parenthesized_declarator": 297,
  "call#comma_expression": 298,
  "preproc_directive#preproc_call": 299,
  "keyword#field_declaration": 300,
  "string_literal#abstract_array_declarator": 301,
  "field_identifier#function_declarator": 302,
  "keyword#labeled_statement": 303,
  "number_literal#expression_statement": 304,
  "keyword#macro_type_specifier": 305,
  "type#conditional_expression": 306,
  "type#field_designator": 307,
  "string_literal#update_expression": 308,
  "directive#preproc_def": 309,
  "identifier#preproc_def": 310,
  "preproc_arg#preproc_def": 311,
  "string_literal#pointer_expression": 312,
  "call#initializer_list": 313,
  "u\"#ERROR": 314,
  "keyword#subscript_designator": 315,
  "boolean#subscript_expression": 316,
  "boolean#for_statement": 317,
  "keyword#translation_unit": 318,
  "boolean#declaration": 319,
  "op#preproc_defined": 320,
  "punctuation#preproc_defined": 321,
  "identifier#preproc_defined": 322,
  "op#parameter_declaration": 323,
  "type#sizeof_expression": 324,
  "type#labeled_statement": 325,
  "boolean#parenthesized_declarator": 326,
  "L\"#ERROR": 327,
  "U'#ERROR": 328,
  "call#sizeof_expression": 329,
  "_Atomic#type_qualifier": 330,
  "preproc_directive#ERROR": 331,
  "type#enumerator": 332,
  "directive#preproc_else": 333,
  "keyword#modifiers": 334,
  "type_identifier#local_variable_declaration": 335,
  "identifier#variable_declarator": 336,
  "punctuation#formal_parameters": 337,
  "type_identifier#formal_parameter": 338,
  "identifier#formal_parameter": 339,
  "punctuation#block": 340,
  "type_identifier#array_type": 341,
  "punctuation#dimensions": 342,
  "op#variable_declarator": 343,
  "identifier#method_invocation": 344,
  "punctuation#method_invocation": 345,
  "punctuation#local_variable_declaration": 346,
  "string_literal#variable_declarator": 347,
  "type#integral_type": 348,
  "identifier#field_access": 349,
  "punctuation#field_access": 350,
  "decimal_integer_literal#binary_expression": 351,
  "identifier#array_access": 352,
  "punctuation#array_access": 353,
  "decimal_integer_literal#array_access": 354,
  "type_identifier#generic_type": 355,
  "op#type_arguments": 356,
  "type_identifier#type_arguments": 357,
  "keyword#object_creation_expression": 358,
  "punctuation#class_body": 359,
  "@#marker_annotation": 360,
  "identifier#marker_annotation": 361,
  "identifier#method_declaration": 362,
  "decimal_integer_literal#unary_expression": 363,
  "decimal_integer_literal#return_statement": 364,
  "type_identifier#object_creation_expression": 365,
  "decimal_integer_literal#argument_list": 366,
  "keyword#enhanced_for_statement": 367,
  "punctuation#enhanced_for_statement": 368,
  "type_identifier#enhanced_for_statement": 369,
  "identifier#enhanced_for_statement": 370,
  "keyword#variable_declarator": 371,
  "type#local_variable_declaration": 372,
  "op#ternary_expression": 373,
  "identifier#ternary_expression": 374,
  "punctuation#ternary_expression": 375,
  "call#method_invocation": 376,
  "decimal_integer_literal#variable_declarator": 377,
  "character_literal#binary_expression": 378,
  "character_literal#assignment_expression": 379,
  "boolean_type#local_variable_declaration": 380,
  "boolean_type#array_type": 381,
  "keyword#array_creation_expression": 382,
  "boolean_type#array_creation_expression": 383,
  "punctuation#dimensions_expr": 384,
  "punctuation#type_arguments": 385,
  "identifier#dimensions_expr": 386,
  "decimal_integer_literal#assignment_expression": 387,
  "keyword#field_access": 388,
  "punctuation#array_initializer": 389,
  "string_literal#array_initializer": 390,
  "decimal_integer_literal#dimensions_expr": 391,
  "string_literal#method_invocation": 392,
  "final#modifiers": 393,
  "decimal_integer_literal#array_initializer": 394,
  "identifier#array_initializer": 395,
  "type#floating_point_type": 396,
  "character_literal#argument_list": 397,
  "type_identifier#array_creation_expression": 398,
  "call#variable_declarator": 399,
  "string_literal#ternary_expression": 400,
  "keyword#ternary_expression": 401,
  "binary_integer_literal#binary_expression": 402,
  "decimal_integer_literal#ternary_expression": 403,
  "character_literal#array_initializer": 404,
  "throws#ERROR": 405,
  "keyword#method_invocation": 406,
  "keyword#formal_parameter": 407,
  "keyword#array_access": 408,
  "boolean_type#formal_parameter": 409,
  "call#array_access": 410,
  "decimal_floating_point_literal#binary_expression": 411,
  "keyword#try_statement": 412,
  "keyword#catch_clause": 413,
  "punctuation#catch_clause": 414,
  "type_identifier#catch_type": 415,
  "identifier#catch_formal_parameter": 416,
  ">>>=#assignment_expression": 417,
  "keyword#throw_statement": 418,
  "type_identifier#scoped_type_identifier": 419,
  "punctuation#scoped_type_identifier": 420,
  "punctuation#throw_statement": 421,
  "hex_integer_literal#binary_expression": 422,
  "super#method_invocation": 423,
  "type_identifier#cast_expression": 424,
  "decimal_floating_point_literal#argument_list": 425,
  "punctuation#inferred_parameters": 426,
  "identifier#inferred_parameters": 427,
  "punctuation#lambda_expression": 428,
  "::#method_reference": 429,
  "identifier#method_reference": 430,
  "identifier#lambda_expression": 431,
  "keyword#lambda_expression": 432,
  "byte#integral_type": 433,
  "finally#finally_clause": 434,
  "string_literal#lambda_expression": 435,
  "op#wildcard": 436,
  "keyword#synchronized_statement": 437,
  "type#variable_declarator": 438,
  "identifier#instanceof_expression": 439,
  "instanceof#instanceof_expression": 440,
  "type_identifier#instanceof_expression": 441,
  "keyword#try_with_resources_statement": 442,
  "punctuation#resource_specification": 443,
  "type_identifier#resource": 444,
  "identifier#resource": 445,
  "op#resource": 446,
  "punctuation#program": 447,
  "keyword#method_reference": 448,
  "type_identifier#spread_parameter": 449,
  "...#spread_parameter": 450,
  "type_identifier#method_declaration": 451,
  "keyword#instanceof_expression": 452,
  ">>>#binary_expression": 453,
  "character_literal#cast_expression": 454,
  "type#method_invocation": 455,
  "super#ERROR": 456,
  "abstract#modifiers": 457,
  "type_identifier#annotated_type": 458,
  "@#annotation": 459,
  "identifier#annotation": 460,
  "punctuation#annotation_argument_list": 461,
  "string_literal#annotation_argument_list": 462,
  "type#method_declaration": 463,
  "type#field_access": 464,
  "identifier#throw_statement": 465,
  "keyword#generic_type": 466,
  "keyword#switch_expression": 467,
  "punctuation#switch_block": 468,
  "keyword#switch_label": 469,
  "punctuation#switch_block_statement_group": 470,
  "string_literal#switch_label": 471,
  "identifier#switch_label": 472,
  "keyword#inferred_parameters": 473,
  "extends#wildcard": 474,
  "type_identifier#wildcard": 475,
  "call#scoped_type_identifier": 476,
  "boolean#field_access": 477,
  "call#instanceof_expression": 478,
  "character_literal#switch_label": 479,
  "punctuation#class_literal": 480,
  "keyword#class_literal": 481,
  "super#field_access": 482,
  "character_literal#ternary_expression": 483,
  "hex_integer_literal#cast_expression": 484,
  "call#formal_parameter": 485,
  "call#field_access": 486,
  "identifier#labeled_statement": 487,
  "identifier#break_statement": 488,
  "identifier#continue_statement": 489,
  "hex_integer_literal#assignment_expression": 490,
  "character_literal#variable_declarator": 491,
  "type#formal_parameter": 492,
  "decimal_floating_point_literal#unary_expression": 493,
  "decimal_integer_literal#switch_label": 494,
  "boolean#switch_label": 495,
  "punctuation#element_value_array_initializer": 496,
  "string_literal#element_value_array_initializer": 497,
  "super#wildcard": 498,
  "decimal_integer_literal#ERROR": 499,
  "decimal_floating_point_literal#ERROR": 500,
  "throws#throws": 501,
  "type_identifier#throws": 502,
  "boolean_type#class_literal": 503,
  "decimal_integer_literal#parenthesized_expression": 504,
  "call#enhanced_for_statement": 505,
  "hex_integer_literal#argument_list": 506,
  "hex_integer_literal#variable_declarator": 507,
  "boolean_type#method_declaration": 508,
  "decimal_floating_point_literal#array_initializer": 509,
  "identifier#element_value_pair": 510,
  "op#element_value_pair": 511,
  "decimal_integer_literal#cast_expression": 512,
  "decimal_floating_point_literal#cast_expression": 513,
  "keyword#class_declaration": 514,
  "identifier#class_declaration": 515,
  "extends#superclass": 516,
  "type_identifier#superclass": 517,
  "string_literal#element_value_pair": 518,
  "keyword#array_initializer": 519,
  "decimal_floating_point_literal#variable_declarator": 520,
  "keyword#element_value_pair": 521,
  "identifier#annotation_argument_list": 522,
  "boolean_type#ERROR": 523,
  "type#class_literal": 524,
  "boolean_type#cast_expression": 525,
  "to#ERROR": 526,
  "decimal_integer_literal#element_value_pair": 527,
  "decimal_integer_literal#annotation_argument_list": 528,
  "decimal_integer_literal#element_value_array_initializer": 529,
  "implements#super_interfaces": 530,
  "identifier#constructor_declaration": 531,
  "punctuation#constructor_body": 532,
  "super#explicit_constructor_invocation": 533,
  "punctuation#explicit_constructor_invocation": 534,
  "op#catch_type": 535,
  "decimal_floating_point_literal#assignment_expression": 536,
  "boolean_type#enhanced_for_statement": 537,
  "decimal_floating_point_literal#return_statement": 538,
  "call#method_declaration": 539,
  "decimal_floating_point_literal#ternary_expression": 540,
  "call#ternary_expression": 541,
  "decimal_floating_point_literal#parenthesized_expression": 542,
  "decimal_integer_literal#expression_statement": 543,
  "character_literal#return_statement": 544,
  "@#ERROR": 545,
  "keyword#method_declaration": 546,
  "hex_floating_point_literal#parenthesized_expression": 547,
  "native#modifiers": 548,
  "extends#ERROR": 549,
  "identifier#scoped_identifier": 550,
  "punctuation#scoped_identifier": 551,
  "decimal_floating_point_literal#expression_statement": 552,
  "call#method_reference": 553,
  "boolean_type#spread_parameter": 554,
  "punctuation#throws": 555,
  "type#ternary_expression": 556,
  "hex_integer_literal#return_statement": 557,
  "character_literal#parenthesized_expression": 558,
  "type#scoped_type_identifier": 559,
  "character_literal#ERROR": 560,
  "call#inferred_parameters": 561,
  "call#array_initializer": 562,
  "call#assert_statement": 563,
  "punctuation#assert_statement": 564,
  "string_literal#assert_statement": 565,
  "hex_integer_literal#unary_expression": 566,
  "call#local_variable_declaration": 567,
  "call#object_creation_expression": 568,
  "character_literal#unary_expression": 569,
  "keyword#assert_statement": 570,
  "op#type_parameters": 571,
  "identifier#type_parameter": 572,
  "final#ERROR": 573,
  "hex_integer_literal#element_value_pair": 574,
  "hex_integer_literal#ternary_expression": 575,
  "identifier#element_value_array_initializer": 576,
  "hex_integer_literal#switch_label": 577,
  "byte#ERROR": 578,
  "call#dimensions_expr": 579,
  "hex_integer_literal#array_initializer": 580,
  "identifier#assert_statement": 581,
  "type#instanceof_expression": 582,
  "boolean#method_invocation": 583,
  "boolean#ternary_expression": 584,
  "boolean_type#field_declaration": 585,
  "type_identifier#interface_type_list": 586,
  "keyword#annotated_type": 587,
  "punctuation#interface_type_list": 588,
  "keyword#scoped_type_identifier": 589,
  "type#enhanced_for_statement": 590,
  "record#ERROR": 591,
  "decimal_integer_literal#lambda_expression": 592,
  "identifier#object_creation_expression": 593,
  "punctuation#object_creation_expression": 594,
  "type#inferred_parameters": 595,
  "punctuation#while_statement": 596,
  "op#return_statement": 597,
  "op#field_access": 598,
  "hex_integer_literal#parenthesized_expression": 599,
  "call#lambda_expression": 600,
  "call#catch_formal_parameter": 601,
  "punctuation#if_statement": 602,
  "boolean#lambda_expression": 603,
  "yield#yield_statement": 604,
  "punctuation#yield_statement": 605,
  "yield#ERROR": 606,
  "keyword#annotation_argument_list": 607,
  "binary_integer_literal#unary_expression": 608,
  "binary_integer_literal#ternary_expression": 609,
  "decimal_floating_point_literal#lambda_expression": 610,
  "strictfp#modifiers": 611,
  "boolean#element_value_pair": 612,
  "keyword#resource": 613,
  "hex_floating_point_literal#binary_expression": 614,
  "hex_floating_point_literal#assignment_expression": 615,
  "hex_floating_point_literal#unary_expression": 616,
  "hex_floating_point_literal#argument_list": 617,
  "binary_integer_literal#variable_declarator": 618,
  "binary_integer_literal#assignment_expression": 619,
  "type#lambda_expression": 620,
  "binary_integer_literal#parenthesized_expression": 621,
  "op#cast_expression": 622,
  "binary_integer_literal#array_initializer": 623,
  "super#method_reference": 624,
  "binary_integer_literal#cast_expression": 625,
  "with#ERROR": 626,
  "string_literal#method_reference": 627,
  "decimal_floating_point_literal#element_value_pair": 628,
  "keyword#local_variable_declaration": 629,
  "hex_integer_literal#array_access": 630,
  "call#expression_statement": 631,
  "punctuation#method_declaration": 632,
  "extends#type_bound": 633,
  "type_identifier#type_bound": 634,
  "binary_integer_literal#argument_list": 635,
  "decimal_floating_point_literal#element_value_array_initializer": 636,
  "punctuation#type_parameters": 637,
  "call#element_value_pair": 638,
  "identifier#receiver_parameter": 639,
  "punctuation#receiver_parameter": 640,
  "keyword#receiver_parameter": 641,
  "type#array_initializer": 642,
  "hex_integer_literal#dimensions_expr": 643,
  "open#ERROR": 644,
  "boolean#scoped_type_identifier": 645,
  "instanceof#ERROR": 646,
  "keyword#element_value_array_initializer": 647,
  "character_literal#element_value_pair": 648,
  "type#method_reference": 649,
  "call#switch_label": 650,
  "call#resource": 651,
  "op#argument_list": 652,
  "op#method_invocation": 653,
  "op#formal_parameter": 654,
  "type#annotated_type": 655,
  "op#type_bound": 656,
  "type#array_access": 657,
  "hex_integer_literal#ERROR": 658,
  "exports#ERROR": 659,
  "transient#modifiers": 660,
  "character_literal#array_access": 661,
  "boolean#enhanced_for_statement": 662,
  "call#throw_statement": 663,
  "keyword#explicit_constructor_invocation": 664,
  "boolean#variable_declarator": 665,
  "type_identifier#method_reference": 666,
  "transitive#ERROR": 667,
  "type#assert_statement": 668,
  "punctuation#switch_rule": 669,
  "punctuation#switch_label": 670,
  "decimal_floating_point_literal#annotation_argument_list": 671,
  "namespace_identifier#qualified_identifier": 672,
  "::#qualified_identifier": 673,
  "identifier#qualified_identifier": 674,
  "keyword#noexcept": 675,
  "op#default_method_clause": 676,
  "keyword#default_method_clause": 677,
  "punctuation#default_method_clause": 678,
  "op#destructor_name": 679,
  "identifier#destructor_name": 680,
  "type_identifier#qualified_identifier": 681,
  "op#reference_declarator": 682,
  "identifier#reference_declarator": 683,
  "keyword#qualified_identifier": 684,
  "punctuation#condition_clause": 685,
  "keyword#template_function": 686,
  "op#template_argument_list": 687,
  "punctuation#lambda_capture_specifier": 688,
  "punctuation#trailing_return_type": 689,
  "type#trailing_return_type": 690,
  "identifier#condition_clause": 691,
  "identifier#template_function": 692,
  "keyword#lambda_capture_specifier": 693,
  "type_identifier#template_type": 694,
  "type_identifier#compound_literal_expression": 695,
  "keyword#alias_declaration": 696,
  "type_identifier#alias_declaration": 697,
  "op#alias_declaration": 698,
  "punctuation#alias_declaration": 699,
  "identifier#lambda_capture_specifier": 700,
  "keyword#variadic_parameter_declaration": 701,
  "...#variadic_declarator": 702,
  "identifier#variadic_declarator": 703,
  "keyword#decltype": 704,
  "punctuation#decltype": 705,
  "...#parameter_pack_expansion": 706,
  "keyword#using_declaration": 707,
  "identifier#using_declaration": 708,
  "punctuation#using_declaration": 709,
  "number_literal#template_argument_list": 710,
  "punctuation#template_argument_list": 711,
  "punctuation#field_initializer_list": 712,
  "field_identifier#field_initializer": 713,
  "keyword#operator_name": 714,
  "op#operator_name": 715,
  "call#qualified_identifier": 716,
  "keyword#static_assert_declaration": 717,
  "punctuation#static_assert_declaration": 718,
  "string_literal#static_assert_declaration": 719,
  "field_identifier#template_method": 720,
  "keyword#dependent_type": 721,
  "punctuation#structured_binding_declarator": 722,
  "identifier#structured_binding_declarator": 723,
  "keyword#new_expression": 724,
  "type#new_expression": 725,
  "punctuation#new_declarator": 726,
  "identifier#new_declarator": 727,
  "keyword#delete_expression": 728,
  "punctuation#delete_expression": 729,
  "identifier#delete_expression": 730,
  "type_identifier#new_expression": 731,
  "keyword#for_range_loop": 732,
  "punctuation#for_range_loop": 733,
  "identifier#for_range_loop": 734,
  "op#lambda_default_capture": 735,
  "op#abstract_reference_declarator": 736,
  "type#for_range_loop": 737,
  "()#operator_name": 738,
  "keyword#condition_clause": 739,
  "keyword#dependent_name": 740,
  "type_identifier#for_range_loop": 741,
  "type_identifier#variadic_parameter_declaration": 742,
  "field_identifier#qualified_identifier": 743,
  "type_identifier#trailing_return_type": 744,
  "type#qualified_identifier": 745,
  "[]#operator_name": 746,
  "keyword#explicit_function_specifier": 747,
  "identifier#parameter_pack_expansion": 748,
  "identifier#template_argument_list": 749,
  "keyword#virtual_function_specifier": 750,
  "type#initializer_pair": 751,
  "identifier#decltype": 752,
  "type#optional_parameter_declaration": 753,
  "identifier#optional_parameter_declaration": 754,
  "op#optional_parameter_declaration": 755,
  "number_literal#optional_parameter_declaration": 756,
  "keyword#optional_parameter_declaration": 757,
  "op#field_declaration": 758,
  "string_literal#field_declaration": 759,
  "number_literal#field_declaration": 760,
  "override#virtual_specifier": 761,
  "type_identifier#optional_parameter_declaration": 762,
  "field_identifier#parenthesized_declarator": 763,
  "[[#attribute_declaration": 764,
  "identifier#attribute": 765,
  "]]#attribute_declaration": 766,
  "string_literal#optional_parameter_declaration": 767,
  "raw_string_literal#argument_list": 768,
  "keyword#template_argument_list": 769,
  "op#declaration": 770,
  "type#reference_declarator": 771,
  "raw_string_literal#binary_expression": 772,
  "raw_string_literal#init_declarator": 773,
  "keyword#template_type": 774,
  "raw_string_literal#assignment_expression": 775,
  "call#lambda_capture_specifier": 776,
  "...#parameter_list": 777,
  "keyword#access_specifier": 778,
  "punctuation#access_specifier": 779,
  "op#delete_method_clause": 780,
  "keyword#delete_method_clause": 781,
  "punctuation#delete_method_clause": 782,
  "call#template_function": 783,
  "call#condition_clause": 784,
  "number_literal#new_declarator": 785,
  "keyword#class_specifier": 786,
  "type_identifier#class_specifier": 787,
  "punctuation#base_class_clause": 788,
  "keyword#base_class_clause": 789,
  "type_identifier#base_class_clause": 790,
  "field_identifier#reference_declarator": 791,
  "number_literal#condition_clause": 792,
  "op#condition_clause": 793,
  "call#reference_declarator": 794,
  "identifier#field_declaration": 795,
  "number_literal#lambda_capture_specifier": 796,
  "keyword#template_declaration": 797,
  "op#template_parameter_list": 798,
  "string_literal#throw_statement": 799,
  "keyword#throw_specifier": 800,
  "punctuation#throw_specifier": 801,
  "call#for_range_loop": 802,
  "keyword#field_initializer": 803,
  "punctuation#operator_name": 804,
  "::#new_expression": 805,
  "raw_string_literal#initializer_list": 806,
  "raw_string_literal#return_statement": 807,
  "raw_string_literal#conditional_expression": 808,
  "final#virtual_specifier": 809,
  "keyword#operator_cast": 810,
  "type#operator_cast": 811,
  "keyword#trailing_return_type": 812,
  "keyword#reference_declarator": 813,
  "call#field_initializer": 814,
  "keyword#compound_literal_expression": 815,
  "keyword#namespace_definition": 816,
  "identifier#namespace_definition": 817,
  "punctuation#declaration_list": 818,
  "keyword#type_parameter_declaration": 819,
  "type_identifier#type_parameter_declaration": 820,
  "string_literal#user_defined_literal": 821,
  "literal_suffix#user_defined_literal": 822,
  "number_literal#user_defined_literal": 823,
  "number_literal#update_expression": 824,
  "type_identifier#operator_cast": 825,
  "call#delete_expression": 826,
  "type#condition_clause": 827,
  "raw_string_literal#initializer_pair": 828,
  "call#structured_binding_declarator": 829,
  "...#sizeof_expression": 830,
  "keyword#co_await_expression": 831,
  "identifier#co_await_expression": 832,
  "keyword#co_return_statement": 833,
  "punctuation#co_return_statement": 834,
  "number_literal#co_await_expression": 835,
  "identifier#co_return_statement": 836,
  "type#compound_literal_expression": 837,
  "namespace_identifier#ERROR": 838,
  "punctuation#template_parameter_list": 839,
  "keyword#variadic_type_parameter_declaration": 840,
  "...#variadic_type_parameter_declaration": 841,
  "type_identifier#variadic_type_parameter_declaration": 842,
  "punctuation#enum_specifier": 843,
  "type#enum_specifier": 844,
  "call#destructor_name": 845,
  "keyword#namespace_alias_definition": 846,
  "identifier#namespace_alias_definition": 847,
  "op#namespace_alias_definition": 848,
  "punctuation#namespace_alias_definition": 849,
  "call#template_method": 850,
  "override#ERROR": 851,
  "field_identifier#function_definition": 852,
  "punctuation#template_declaration": 853,
  "type#template_type": 854,
  "u8'#char_literal": 855,
  "punctuation#attribute_declaration": 856,
  "punctuation#noexcept": 857,
  "string_literal#for_range_loop": 858,
  "[]#ERROR": 859,
  "\"\"#operator_name": 860,
  "identifier#operator_name": 861,
  "number_literal#parameter_pack_expansion": 862,
  "keyword#parameter_pack_expansion": 863,
  "op#ref_qualifier": 864,
  "keyword#friend_declaration": 865,
  "type_identifier#friend_declaration": 866,
  "punctuation#friend_declaration": 867,
  "::#delete_expression": 868,
  "identifier#static_assert_declaration": 869,
  "raw_string_literal#ERROR": 870,
  "type#template_argument_list": 871,
  "number_literal#throw_statement": 872,
  "call#user_defined_literal": 873,
  "call#optional_parameter_declaration": 874,
  "keyword#optional_type_parameter_declaration": 875,
  "type_identifier#optional_type_parameter_declaration": 876,
  "op#optional_type_parameter_declaration": 877,
  "punctuation#translation_unit": 878,
  "call#template_type": 879,
  "type#template_function": 880,
  "type#template_method": 881,
  "type_identifier#dependent_type": 882,
  "call#type_definition": 883,
  "type#optional_type_parameter_declaration": 884,
  "keyword#template_method": 885,
  "keyword#template_instantiation": 886,
  "type_identifier#template_instantiation": 887,
  "punctuation#template_instantiation": 888,
  "string_literal#lambda_capture_specifier": 889,
  "->*#operator_name": 890,
  "u'#char_literal": 891,
  "U'#char_literal": 892,
  "keyword#user_defined_literal": 893,
  "string_literal#template_argument_list": 894,
  "type#user_defined_literal": 895,
  "keyword#structured_binding_declarator": 896,
  "::#attribute": 897,
  "raw_string_literal#concatenated_string": 898,
  "identifier#noexcept": 899,
  "keyword#co_yield_statement": 900,
  "punctuation#co_yield_statement": 901,
  "number_literal#co_yield_statement": 902,
  "call#alias_declaration": 903,
  "identifier#co_yield_statement": 904,
  "string_literal#co_return_statement": 905,
  "number_literal#co_return_statement": 906,
  "string_literal#co_yield_statement": 907,
  "type#destructor_name": 908,
  "[[#ERROR": 909,
  "identifier#attributed_declarator": 910,
  "type#field_initializer": 911,
  "raw_string_literal#call_expression": 912,
  "type#structured_binding_declarator": 913,
  "string_literal#case_statement": 914,
  "keyword#enumerator": 915,
  "op#function_declarator": 916,
  "boolean#condition_clause": 917,
  "string_literal#array_declarator": 918,
  "number_literal#decltype": 919,
  "call#trailing_return_type": 920,
  "ms_restrict_modifier#ERROR": 921,
  "keyword#linkage_specification": 922,
  "string_literal#linkage_specification": 923,
  "type#template_instantiation": 924,
  "type#base_class_clause": 925,
  "call#attribute": 926,
  "nl": 927
}